/// Custom class to model the page content
class PageContent {
  final String title;
  final String content;

  /// 构造函数
  PageContent({required this.title, required this.content});
}

List<PageContent> pageContents = [
  PageContent(
    title: '隐匿山林间的奢华天堂',
    content:
        '远离城市喧嚣25公里，松云谷豪华露营地坐落于青山翠谷之间，将原始自然之美与现代奢华完美融合。这里是都市人的理想栖息地，让访客能够暂时远离日常生活的繁忙，沉浸在群山环抱的宁静氛围中。',
  ),
  PageContent(
    title: '云端木屋，静享山居',
    content:
        '松云谷的每间木屋都经过精心设计，完美平衡了舒适度与自然体验。落地窗设计让住客在晨光中便能饱览壮丽山景。无论是在露台品茶小憩，还是在屋内读书休闲，都能享受到独特的度假体验。',
  ),
  PageContent(
    title: '探索自然的无限魅力',
    content:
        '对于热爱探险的旅行者来说，松云谷提供了丰富的户外活动选择。游客可以徒步穿越葱郁森林，探索附近的清澈瀑布，或参加专业向导带领的生态探索之旅。周边的山丘也是观鸟爱好者的天堂，栖息着众多独特的鸟类。',
  ),
  PageContent(
    title: '野奢体验的极致诠释',
    content:
        '豪华露营是露营与奢华的完美结合，而松云谷将这种体验提升到了新的高度。柔软的寝具、时尚的内饰和现代化的设施，让游客在享受自然之美的同时不失舒适。此外，营地还配备了温泉浴池、户外休息区，以及一个让人赏心悦目的餐厅，让您在品味当地美食的同时欣赏壮丽的自然景观。',
  ),
  PageContent(
    title: '心灵相连的理想之地',
    content:
        '无论是与朋友、家人还是伴侣同行，松云谷都能为您提供一个促进情感交流的私密空间。远离尘嚣的位置确保了绝对的隐私，让客人能够真正放松身心，与亲朋好友建立更深的情感联系。夜晚的星空格外清晰，微弱的光污染让这里成为观星的绝佳地点。',
  ),
  PageContent(
    title: '可持续发展的生态度假',
    content:
        '松云谷始终致力于可持续发展理念。所有木屋都采用环保材料建造，营地运营注重将对环境的影响降到最低。游客在享受假期的同时，也为保护这片原始自然环境贡献了一份力量。',
  ),
  PageContent(
    title: '独特的自然探索之旅',
    content:
        '在松云谷，每一天都是新的冒险。游客可以参与各种丰富的户外活动，从清晨的瑜伽课程到傍晚的营火晚会，从森林徒步到溪流探索，每一个活动都经过精心设计，让您能够充分感受大自然的馈赠，留下难忘的回忆。',
  ),
];
